# Data Selection

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Application Number')
df

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

## Column Selection (Label)

In [2]:
df['Name']

Application Number
#1      Ian
#2    Jason
#3    Smith
#4     John
#5     Kara
#6    Daisy
#7     Jack
#8    Poppy
Name: Name, dtype: object

In [3]:
df[['Name', 'Height']]

                     Name  Height
Application Number
#1                    Ian     178
#2                  Jason     198
#3                  Smith     168
#4                   John     188
#5                   Kara     201
#6                  Daisy     172
#7                   Jack     174
#8                  Poppy     180

## Column Selection (Number Index)

In [4]:
df.columns

Index(['Name', 'School', 'Height', 'English', 'Math', 'Biology', 'Finance',
       'Coding'],
      dtype='object')

In [5]:
df.columns[0] # Show name of the first column

'Name'

In [6]:
df.columns[[0,3]]

Index(['Name', 'English'], dtype='object')

In [7]:
df[df.columns[0]] # Show the first column

Application Number
#1      Ian
#2    Jason
#3    Smith
#4     John
#5     Kara
#6    Daisy
#7     Jack
#8    Poppy
Name: Name, dtype: object

In [8]:
df[df.columns[-1]] # The last column

Application Number
#1    Python
#2       NaN
#3       C++
#4      Java
#5       NaN
#6       NaN
#7         R
#8    Python
Name: Coding, dtype: object

## Slicing

In [9]:
df['English'][0:5] # Show from 0 to 4 data

Application Number
#1     90
#2    100
#3     85
#4     70
#5     82
Name: English, dtype: int64

In [10]:
df[['Name', 'Height']][:3] # Show the first 3 rows of Name and Height

                     Name  Height
Application Number
#1                    Ian     178
#2                  Jason     198
#3                  Smith     168

In [11]:
df[3:]

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python